cars = [1 1 2 1 2 3 1 2 3 4 1 2 3 4 5];
bal = [45 97 85 60 85 40 68 55 50 63 97 75 45 75 55 90 70 65 85 85 68 96 47 57];

figure;
subplot(2, 1, 1);
bar(cars)
title('Стовпцева діагра проїхавших машин')
xlabel( '15-ти десятихвилинні інтервали')
ylabel('Діапазон проїхавших машин')

subplot(2, 1, 2);
hist(cars)
title('Гістограма розподілу балів студента')
xlabel( 'Діапазон проїхавших машин')
ylabel('Кількість повторів')

figure;
subplot(2, 1, 1);
bar(bal)
title('Стовпцева діагра балів студента')
xlabel( 'Номер предметів')
ylabel('Діапазон балів')

subplot(2, 1, 2);
hist(bal)
title('Гістограма розподілу балів студента')
xlabel( 'Діапазон балів')
ylabel('Кількість повторів')

